from __future__ import unicode_literals

import copy
from itertools import *
import json
from math import *
import pickle
from hazm import *

docsContents, docsTitles, docsUrls, positionalIndex, docsRanks, phrases, champion, stopWordsList = [], [], [], {}, {}, [], {}, ["با",
                                                                                                                  "و",
                                                                                                                  "در",
                                                                                                                  "ولی",
                                                                                                                  "اما",
                                                                                                                  "نیز",
                                                                                                                  "اگر",
                                                                                                                  "که",
                                                                                                                  "مگر",
                                                                                                                  "از",
                                                                                                                  "بر",
                                                                                                                  "تا",
                                                                                                                  "بی",
                                                                                                                  "الا",
                                                                                                                  "غیر",
                                                                                                                  ".",
                                                                                                                  ",",
                                                                                                                  "،",
                                                                                                                  ".",
                                                                                                                  "/",
                                                                                                                  "را",
                                                                                                                  "مانند",
                                                                                                                  "جزو",
                                                                                                                  ":",
                                                                                                                  "به",
                                                                                                                  "؛",
                                                                                                                  "اینجا",
                                                                                                                  "گردد",
                                                                                                                  "این",
                                                                                                                  "است",
                                                                                                                  "زاده",
                                                                                                                  "لذا",
                                                                                                                  "می‌یابد",
                                                                                                                  "دوباره",
                                                                                                                  "،",
                                                                                                                  "اغلب",
                                                                                                                  "جمعی",
                                                                                                                  "گاه",
                                                                                                                  "خاطرنشان",
                                                                                                                  "پر",
                                                                                                                  "یافته_است",
                                                                                                                  "نیستند",
                                                                                                                  "برای",
                                                                                                                  "آن",
                                                                                                                  "یک",
                                                                                                                  "خود",
                                                                                                                  "کرد",
                                                                                                                  "هم",
                                                                                                                  "گفت",
                                                                                                                  "می‌شود",
                                                                                                                  "وی",
                                                                                                                  "شد",
                                                                                                                  "دارد",
                                                                                                                  "ما",
                                                                                                                  "یا",
                                                                                                                  "شده",
                                                                                                                  "باید",
                                                                                                                  "هر",
                                                                                                                  "آنها",
                                                                                                                  "بود",
                                                                                                                  "او",
                                                                                                                  "دیگر",
                                                                                                                  "دو",
                                                                                                                  "مورد",
                                                                                                                  "می‌کند",
                                                                                                                  "شود",
                                                                                                                  "کند",
                                                                                                                  "وجود",
                                                                                                                  "بین",
                                                                                                                  "پیش",
                                                                                                                  "شده_است",
                                                                                                                  "پس",
                                                                                                                  "نظر",
                                                                                                                  "همه",
                                                                                                                  "یکی",
                                                                                                                  "حال",
                                                                                                                  "هستند",
                                                                                                                  "من",
                                                                                                                  "کنند",
                                                                                                                  "نیست",
                                                                                                                  "باشد",
                                                                                                                  "چه",
                                                                                                                  "می",
                                                                                                                  "بخش",
                                                                                                                  "می‌کنند",
                                                                                                                  "همین",
                                                                                                                  "افزود",
                                                                                                                  "هایی",
                                                                                                                  "دارند",
                                                                                                                  "راه",
                                                                                                                  "همچنین",
                                                                                                                  "روی",
                                                                                                                  "داد",
                                                                                                                  "بیشتر",
                                                                                                                  "بسیار",
                                                                                                                  "سه",
                                                                                                                  "داشت",
                                                                                                                  "چند",
                                                                                                                  "سوی",
                                                                                                                  "تنها",
                                                                                                                  "هیچ",
                                                                                                                  "میان",
                                                                                                                  "اینکه",
                                                                                                                  "شدن",
                                                                                                                  "بعد",
                                                                                                                  "جدید",
                                                                                                                  "حتی",
                                                                                                                  "کردن",
                                                                                                                  "برخی",
                                                                                                                  "کردند",
                                                                                                                  "می‌دهد",
                                                                                                                  "اول",
                                                                                                                  "نه",
                                                                                                                  "کرده_است",
                                                                                                                  "نسبت",
                                                                                                                  "بیش",
                                                                                                                  "شما",
                                                                                                                  "چنین",
                                                                                                                  "طور",
                                                                                                                  "افراد",
                                                                                                                  "تمام",
                                                                                                                  "درباره",
                                                                                                                  "بار",
                                                                                                                  "بسیاری",
                                                                                                                  "می‌تواند",
                                                                                                                  "کرده",
                                                                                                                  "چون",
                                                                                                                  "ندارد",
                                                                                                                  "دوم",
                                                                                                                  "بزرگ",
                                                                                                                  "طی",
                                                                                                                  "حدود",
                                                                                                                  "همان",
                                                                                                                  "بدون",
                                                                                                                  "البته",
                                                                                                                  "آنان",
                                                                                                                  "می‌گوید",
                                                                                                                  "دیگری",
                                                                                                                  "خواهد_شد",
                                                                                                                  "کنیم",
                                                                                                                  "قابل",
                                                                                                                  "یعنی",
                                                                                                                  "رشد",
                                                                                                                  "می‌توان",
                                                                                                                  "وارد",
                                                                                                                  "کل",
                                                                                                                  "ویژه",
                                                                                                                  "قبل",
                                                                                                                  "براساس",
                                                                                                                  "نیاز",
                                                                                                                  "گذاری",
                                                                                                                  "هنوز",
                                                                                                                  "لازم",
                                                                                                                  "سازی",
                                                                                                                  "بوده_است",
                                                                                                                  "چرا",
                                                                                                                  "می‌شوند",
                                                                                                                  "وقتی",
                                                                                                                  "گرفت",
                                                                                                                  "کم",
                                                                                                                  "جای",
                                                                                                                  "حالی",
                                                                                                                  "تغییر",
                                                                                                                  "پیدا",
                                                                                                                  "اکنون",
                                                                                                                  "تحت",
                                                                                                                  "باعث",
                                                                                                                  "مدت",
                                                                                                                  "فقط",
                                                                                                                  "زیادی",
                                                                                                                  "تعداد",
                                                                                                                  "آیا",
                                                                                                                  "بیان",
                                                                                                                  "رو",
                                                                                                                  "شدند",
                                                                                                                  "عدم",
                                                                                                                  "کرده_اند",
                                                                                                                  "بودن",
                                                                                                                  "نوع",
                                                                                                                  "بلکه",
                                                                                                                  "جاری",
                                                                                                                  "دهد",
                                                                                                                  "برابر",
                                                                                                                  "مهم",
                                                                                                                  "بوده",
                                                                                                                  "اخیر",
                                                                                                                  "مربوط",
                                                                                                                  "امر",
                                                                                                                  "زیر",
                                                                                                                  "گیری",
                                                                                                                  "شاید",
                                                                                                                  "خصوص",
                                                                                                                  "آقای",
                                                                                                                  "اثر",
                                                                                                                  "کننده",
                                                                                                                  "بودند",
                                                                                                                  "فکر",
                                                                                                                  "کنار",
                                                                                                                  "اولین",
                                                                                                                  "سوم",
                                                                                                                  "سایر",
                                                                                                                  "کنید",
                                                                                                                  "ضمن",
                                                                                                                  "باز",
                                                                                                                  "می‌گیرد",
                                                                                                                  "ممکن",
                                                                                                                  "حل",
                                                                                                                  "دارای",
                                                                                                                  "پی",
                                                                                                                  "مثل",
                                                                                                                  "می‌رسد",
                                                                                                                  "اجرا",
                                                                                                                  "دور",
                                                                                                                  "منظور",
                                                                                                                  "کسی",
                                                                                                                  "موجب",
                                                                                                                  "طول",
                                                                                                                  "امکان",
                                                                                                                  "آنچه",
                                                                                                                  "تعیین",
                                                                                                                  "گفته",
                                                                                                                  "شوند",
                                                                                                                  "جمع",
                                                                                                                  "خیلی",
                                                                                                                  "علاوه",
                                                                                                                  "گونه",
                                                                                                                  "تاکنون",
                                                                                                                  "رسید",
                                                                                                                  "ساله",
                                                                                                                  "گرفته",
                                                                                                                  "شده_اند",
                                                                                                                  "علت",
                                                                                                                  "چهار",
                                                                                                                  "داشته_باشد",
                                                                                                                  "خواهد_بود",
                                                                                                                  "طرف",
                                                                                                                  "تهیه",
                                                                                                                  "تبدیل",
                                                                                                                  "مناسب",
                                                                                                                  "زیرا",
                                                                                                                  "مشخص",
                                                                                                                  "می‌توانند",
                                                                                                                  "نزدیک",
                                                                                                                  "جریان",
                                                                                                                  "روند",
                                                                                                                  "بنابراین",
                                                                                                                  "می‌دهند",
                                                                                                                  "یافت",
                                                                                                                  "نخستین",
                                                                                                                  "بالا",
                                                                                                                  "پنج",
                                                                                                                  "ریزی",
                                                                                                                  "عالی",
                                                                                                                  "چیزی",
                                                                                                                  "نخست",
                                                                                                                  "بیشتری",
                                                                                                                  "ترتیب",
                                                                                                                  "شده_بود",
                                                                                                                  "خاص",
                                                                                                                  "خوبی",
                                                                                                                  "خوب",
                                                                                                                  "شروع",
                                                                                                                  "فرد",
                                                                                                                  "کامل",
                                                                                                                  "می‌رود",
                                                                                                                  "دهند",
                                                                                                                  "آخرین",
                                                                                                                  "دادن",
                                                                                                                  "جدی",
                                                                                                                  "بهترین",
                                                                                                                  "شامل",
                                                                                                                  "گیرد",
                                                                                                                  "بخشی",
                                                                                                                  "باشند",
                                                                                                                  "تمامی",
                                                                                                                  "بهتر",
                                                                                                                  "داده_است",
                                                                                                                  "حد",
                                                                                                                  "نبود",
                                                                                                                  "کسانی",
                                                                                                                  "می‌کرد",
                                                                                                                  "داریم",
                                                                                                                  "علیه",
                                                                                                                  "می‌باشد",
                                                                                                                  "دانست",
                                                                                                                  "ناشی",
                                                                                                                  "داشتند",
                                                                                                                  "دهه",
                                                                                                                  "می‌شد",
                                                                                                                  "ایشان",
                                                                                                                  "آنجا",
                                                                                                                  "گرفته_است",
                                                                                                                  "دچار",
                                                                                                                  "می‌آید",
                                                                                                                  "لحاظ",
                                                                                                                  "آنکه",
                                                                                                                  "داده",
                                                                                                                  "بعضی",
                                                                                                                  "هستیم",
                                                                                                                  "اند",
                                                                                                                  "برداری",
                                                                                                                  "نباید",
                                                                                                                  "می‌کنیم",
                                                                                                                  "نشست",
                                                                                                                  "سهم",
                                                                                                                  "همیشه",
                                                                                                                  "آمد",
                                                                                                                  "اش",
                                                                                                                  "وگو",
                                                                                                                  "می‌کنم",
                                                                                                                  "حداقل",
                                                                                                                  "طبق",
                                                                                                                  "جا",
                                                                                                                  "خواهد_کرد",
                                                                                                                  "نوعی",
                                                                                                                  "چگونه",
                                                                                                                  "رفت",
                                                                                                                  "هنگام",
                                                                                                                  "فوق",
                                                                                                                  "روش",
                                                                                                                  "ندارند",
                                                                                                                  "سعی",
                                                                                                                  "بندی",
                                                                                                                  "شمار",
                                                                                                                  "کلی",
                                                                                                                  "کافی",
                                                                                                                  "مواجه",
                                                                                                                  "همچنان",
                                                                                                                  "زیاد",
                                                                                                                  "سمت",
                                                                                                                  "کوچک",
                                                                                                                  "داشته_است",
                                                                                                                  "چیز",
                                                                                                                  "پشت",
                                                                                                                  "آورد",
                                                                                                                  "حالا",
                                                                                                                  "روبه",
                                                                                                                  "سال‌های",
                                                                                                                  "دادند",
                                                                                                                  "می‌کردند",
                                                                                                                  "عهده",
                                                                                                                  "نیمه",
                                                                                                                  "جایی",
                                                                                                                  "دیگران",
                                                                                                                  "سی",
                                                                                                                  "بروز",
                                                                                                                  "یکدیگر",
                                                                                                                  "آمده_است",
                                                                                                                  "جز",
                                                                                                                  "کنم",
                                                                                                                  "سپس",
                                                                                                                  "کنندگان",
                                                                                                                  "خودش",
                                                                                                                  "همواره",
                                                                                                                  "یافته",
                                                                                                                  "شان",
                                                                                                                  "صرف",
                                                                                                                  "نمی‌شود",
                                                                                                                  "رسیدن",
                                                                                                                  "چهارم",
                                                                                                                  "یابد",
                                                                                                                  "متر",
                                                                                                                  "ساز",
                                                                                                                  "داشته",
                                                                                                                  "کرده_بود",
                                                                                                                  "باره",
                                                                                                                  "نحوه",
                                                                                                                  "کردم",
                                                                                                                  "تو",
                                                                                                                  "شخصی",
                                                                                                                  "داشته_باشند",
                                                                                                                  "محسوب",
                                                                                                                  "پخش",
                                                                                                                  "کمی",
                                                                                                                  "متفاوت",
                                                                                                                  "سراسر",
                                                                                                                  "کاملا",
                                                                                                                  "داشتن",
                                                                                                                  "نظیر",
                                                                                                                  "آمده",
                                                                                                                  "گروهی",
                                                                                                                  "فردی",
                                                                                                                  "ع",
                                                                                                                  "همچون",
                                                                                                                  "خطر",
                                                                                                                  "خویش",
                                                                                                                  "کدام",
                                                                                                                  "دسته",
                                                                                                                  "سبب",
                                                                                                                  "عین",
                                                                                                                  "آوری",
                                                                                                                  "متاسفانه",
                                                                                                                  "بیرون",
                                                                                                                  "دار",
                                                                                                                  "ابتدا",
                                                                                                                  "شش",
                                                                                                                  "افرادی",
                                                                                                                  "می‌گویند",
                                                                                                                  "سالهای",
                                                                                                                  '\u200cو',
                                                                                                                  'و\u200c',
                                                                                                                  '\u200cو',
                                                                                                                  "درون"]

# repeatWords = {}

def read():
    f = open('..\..\IR_data_news_5k.json', encoding='utf8')
    data = json.load(f)
    for d in data:
        docsTitles.append(data[d]["title"])
        docsContents.append(data[d]["content"])
        docsUrls.append(data[d]["url"])
    f.close()


def normalize(data, i):
    normalizer, stemmer = Normalizer(), Stemmer()
    data = normalizer.normalize(data)
    tokenizedData = word_tokenize(data)
    for j in range(len(tokenizedData)):
        tokenizedData[j] = stemmer.stem(tokenizedData[j])
    for k in tokenizedData:
        if k in stopWordsList:
            tokenizedData.remove(k)
    index(tokenizedData, i)
    # index(data, i)


def index(tokenizedData, i):
    for j in range(len(tokenizedData)):
        data = tokenizedData[j]
        if data in positionalIndex:
            positionalIndex[data][0] = positionalIndex[data][0] + 1
            if i in positionalIndex[data][1]:
                positionalIndex[data][1][i].append(j)
            else:
                positionalIndex[data][1][i] = [j]
        else:
            positionalIndex[data] = []
            positionalIndex[data].append(1)
            positionalIndex[data].append({})
            positionalIndex[data][1][i] = [j]


def notIn(word):
    if word in positionalIndex.keys():
        for j in positionalIndex[word][1]:
            if j in docsRanks.keys():
                docsRanks.pop(j)


def phrasal(words):
    for w in words:
        if w == '"':
            words_check = words[words.index(w) + 1:]
            phraseRank()
            return words_check
        else:
            phrases.append(w)


def positionCheck(docId, word, position):
    if len(phrases) == 2 and position not in positionalIndex[phrases[1]][1][docId]:
        return
    elif phrases.index(word) == len(phrases) - 1:
        docsRanks[docId] += 1
        return
    elif position not in positionalIndex[word][1][docId]:
        return
    elif position in positionalIndex[word][1][docId]:
        positionCheck(docId, phrases[phrases.index(word) + 1], position + 1)


def phraseRank():
    docsContentsCopy = copy.deepcopy(docsContents)
    positionalIndexCopy = copy.copy(positionalIndex)
    for p in phrases:
        if p not in positionalIndexCopy.keys():
            return
    for p in list(positionalIndexCopy.keys()):
        if p not in phrases:
            del positionalIndexCopy[p]
    for p in range(len(docsContents)):
        for j in phrases:
            if p not in positionalIndexCopy[j][1]:
                docsContentsCopy[p] = " "
    for p in positionalIndexCopy:
        for j in list(positionalIndexCopy[p][1]):
            if docsContentsCopy[j] == " ":
                del positionalIndexCopy[p][1][j]
    for j in positionalIndexCopy[phrases[0]][1]:
        if j not in docsRanks:
            docsRanks[j] = 0

        positionCheck(j, phrases[1], positionalIndexCopy[phrases[0]][1][j][0] + 1)


def printDocs(docs):
    flag = 0
    print()
    for i in docs.keys():
        if flag <= 9:
            print("doc " + str(flag + 1) + ") " + docsTitles[i] + ": " + docsUrls[i])
            lineNum = 0
            for line in list(map(''.join,zip(*[iter(docsContents[i])]*300))):
                if lineNum <= 5:
                    print(line)
                    lineNum += 1
            flag += 1
            print()
        else:
            break


def search(queryWords):
    while len(queryWords) != 0:
        if queryWords[0] == '"':
            queryWords = phrasal(queryWords[1:])
        elif queryWords[0] != '!' and queryWords[0] != '"':
            normalized = queryWords.pop(0)
            normalWords(normalized)
        else:
            queryWords.pop(0)
            word = queryWords.pop(0)
            notIn(word)
    for docs in list(docsRanks.keys()):
        if docsRanks[docs] == 0:
            del docsRanks[docs]


def normalWords(normalized):
    if normalized in positionalIndex.keys():
        for j in positionalIndex[normalized][1]:
            if j in docsRanks.keys():
                docsRanks[j] = docsRanks[j] + len(positionalIndex[normalized][1][j])
            else:
                docsRanks[j] = len(positionalIndex[normalized][1][j])

idfCount = {}
def tf_idf(positionalIndex):
    n = len(docsContents)
    for word in positionalIndex:
        temp, nt = {}, len(positionalIndex[word][1])
        # idf = log(n / nt, 10)
        idf = max(0,log((n - nt) / nt, 10))
        for j in positionalIndex[word][1]:
            ftd = len(positionalIndex[word][1][j])
            tf = 1 + log(ftd, 10)
            positionalIndex[word][1][j].append(1 + log(ftd, 10))
            temp[j] = tf * idf
        sorted_temp = dict(sorted(temp.items(), key=lambda item: item[1], reverse=True))
        if word not in champion.keys():
            champion[word] = []
        if len(sorted_temp) <= 20:
            for i in sorted_temp.keys():
                champion[word].append(i)
        else:
            # for i in sorted_temp.keys():
            #     try:
            #         repeatWords[word] += 1
            #     except:
            #         repeatWords[word] = 0
            for i in islice(sorted_temp, 20):
                champion[word].append(i)
        # for i in sorted_temp.keys():
        #     champion[word].append(i)
        positionalIndex[word].append(idf)
        idfCount[word] = idf


def tfIdf_words(words):
    vec, scores = {}, {}
    # idfCount = {}

    tfCount = [0 for i in range(len(words))]
    index = 0
    for word in words:
        if word in positionalIndex.keys():
            ftd = words.count(word)
            tfCount[index] = (1 + log(ftd, 10))
            index += 1
    sum = 0
    for i in range(len(words)):
        sum += tfCount[i]

    for word in words:
        if word in positionalIndex.keys():
            ftd = words.count(word)
            tf, idf = (1 + log(ftd, 10))/(1 + log(sum/(len(words)))), positionalIndex[word][2]
            vec[word] = tf * idf
            # idfCount[word] = idf
            # vec[word] = idf

    # idfs = [0 for i in range(2*len(idfCount.keys()))]
    # wordsinidfs = [0 for i in range(2*len(idfCount.keys()))]
    # index = 0
    # idfCountKeys = {}
    # for word in idfCount.keys():
    #     idfCountKeys[word] = idfCount[word]
    # for word in idfCountKeys.keys():
    #     idfs[index] = idfCount[word]
    #     wordsinidfs[index] =word
    #     index += 1
    # newWords = {}
    # newWords[wordsinidfs[idfs.index(max(idfs))]] = max(idfs)
    # idfCountKeys.pop(wordsinidfs[idfs.index(max(idfs))])
    # for word in idfCountKeys.keys():
    #     idfs[index] = idfCount[word]
    #     wordsinidfs[index] =word
    #     index += 1
    # newWords[wordsinidfs[idfs.index(max(idfs))]] = max(idfs)
    # for word in newWords:
    #     if word in positionalIndex.keys():
    #         for docId in champion[word]:
    #             if docId not in scores.keys():
    #                 scores[docId] = 0
    #             scores[docId] += positionalIndex[word][1][docId][1] * vec[word]
    # sorted_scores = dict(sorted(scores.items(), key=lambda item: item[1], reverse=True))
    # printDocs(sorted_scores)


    for word in words:
        if word in positionalIndex.keys():
            for docId in champion[word]:
                if docId not in scores.keys():
                    scores[docId] = 0
                scores[docId] += positionalIndex[word][1][docId][1] * vec[word]
    sorted_scores = dict(sorted(scores.items(), key=lambda item: item[1], reverse=True))
    printDocs(sorted_scores)


def loadData():
    # for reading also binary mode is important
    dbfile = open('examplePickle', 'rb')
    db = pickle.load(dbfile)
    for keys in db:
        print(keys, '=>', db[keys])
    dbfile.close()

read()
for i in range(len(docsContents)):
    normalize(docsContents[i], i)
# print(positionalIndex)

# print(f"the length of the positional index is: {len(positionalIndex)}")
#
# dbfile = open('examplePickle', 'ab')
# pickle.dump(positionalIndex, dbfile)
# dbfile.close()

tf_idf(positionalIndex)

# print(repeatWords)
# idfs = [0 for i in range(len(idfCount.keys()))]
# wordsinidfs = [0 for i in range(len(idfCount.keys()))]
# index = 0
# idfCountKeys = {}
# for word in idfCount.keys():
#     idfCountKeys[word] = idfCount[word]
# idfCountKeys.pop("فارس")
# idfCountKeys.pop("سیماک")
# # idfCountKeys.pop('0')
# idfCountKeys.pop("کپه")
# for word in idfCountKeys.keys():
#     idfs[index] = idfCount[word]
#     wordsinidfs[index] =word
#     index += 1
# print(idfCount)
# print("min idf is: ", min(idfs), " the word is: ", wordsinidfs[idfs.index(min(idfs))])
# print("max idf is: ", max(idfs), " the word is: ", wordsinidfs[idfs.index(max(idfs))])

query = input("\nPlease write your query here: \n")
while query:
    normalizer2, stemmer2 = Normalizer(), Stemmer()
    query = normalizer2.normalize(query)
    tokenizedQuery = word_tokenize(query)

    for j in range(len(tokenizedQuery)):
        tokenizedQuery[j] = stemmer2.stem(tokenizedQuery[j])
    for k in tokenizedQuery:
        if k in stopWordsList:
            tokenizedQuery.remove(k)
    docsRanks.clear()
    # search(tokenizedQuery)
    # printDocs(docsRanks)
    tfIdf_words(tokenizedQuery)
    query = input("\nPlease write your new query here: \n")
